# Laboratorio #2

In [1]:
import numpy as np
import pandas as pd
heroes = pd.read_csv('heroes_information.csv')

In [2]:
from pandasql import *
pysqldf = lambda q: sqldf(q, globals())

### Example query

In [3]:
query2 = "SELECT * FROM heroes limit 10"
pysqldf(query2)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0
5,5,Absorbing Man,Male,blue,Human,No Hair,193.0,Marvel Comics,None,bad,122.0
6,6,Adam Monroe,Male,blue,None,Blond,-99.0,NBC - Heroes,None,good,-99.0
7,7,Adam Strange,Male,blue,Human,Blond,185.0,DC Comics,None,good,88.0
8,8,Agent 13,Female,blue,None,Blond,173.0,Marvel Comics,None,good,61.0
9,9,Agent Bob,Male,brown,Human,Brown,178.0,Marvel Comics,None,good,81.0

### Preguntas

1. ¿Cuál es el nombre del primer superhéroe de la tabla heroes?

In [4]:
name = 'SELECT name FROM heroes LIMIT 1'
pysqldf(name)

     name
0  A-Bomb

2. ¿Cuántas casas publicadoras existen?

In [14]:
pubNumber = 'SELECT COUNT(DISTINCT Publisher) AS "Casas publicadoras" FROM heroes'
pysqldf(pubNumber)

   Casas publicadoras
0                  24

3. ¿Cuántos superhéroes miden más de 2 metros (200 cms)

In [6]:
height = 'SELECT COUNT(*) FROM heroes WHERE Height>200.0'
pysqldf(height)

   COUNT(*)
0        59

4. ¿Cuántos superhéroes son humanos y miden más de 2 metros (200 cms)?

In [7]:
humanHeight = 'SELECT COUNT(*) FROM heroes WHERE Height>200.0 AND Race="Human"'
pysqldf(humanHeight)

   COUNT(*)
0        12

5. ¿Cuántos superhéroes pesan más de 100 lbs y menos de 200 lbs?

In [8]:
weight = 'SELECT COUNT(*) FROM heroes WHERE Weight>100 AND Weight<200'
pysqldf(weight)

   COUNT(*)
0        98

6. ¿Cuántos superhéroes tienen los ojos de color azul o rojo?

In [9]:
eyeColor = 'SELECT COUNT(*) FROM heroes WHERE "Eye color"="blue" OR "Eye color"="red"'
pysqldf(eyeColor)

   COUNT(*)
0       271

7. ¿Cuántos superhéroes son Human, Mutant y tienen el pelo color Verde o son Vampiros con pelo Negro?

In [10]:
many = 'SELECT COUNT(*) FROM heroes WHERE ((Race="Human" OR Race="Mutant") AND "Hair color"="Green") OR (Race="Vampire" AND "Hair color"="Black")'
pysqldf(many)

   COUNT(*)
0         5

8. ¿Cuál es el nombre del primer superhéroe si ordeno la tabla por raza en orden descendente?

In [11]:
race = 'SELECT name FROM heroes ORDER BY Race DESC LIMIT 1'
pysqldf(race)

             name
0  Solomon Grundy

9. ¿Cuántos superhéroes son de género masculino y cuántas de género femenino?

In [13]:
gender = 'SELECT Gender, COUNT(*) FROM heroes GROUP BY Gender'
pysqldf(gender)

   Gender  COUNT(*)
0    None        29
1  Female       200
2    Male       505

10. ¿Cuántas casas publicadoras tienen más de 15 superhéroes?

In [16]:
publishers = 'SELECT Publisher, COUNT(*) FROM heroes GROUP BY Publisher HAVING COUNT(Publisher)>15'
pysqldf(publishers)

           Publisher  COUNT(*)
0          DC Comics       215
1  Dark Horse Comics        18
2      Marvel Comics       388
3       NBC - Heroes        19